app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published_date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Harry Potter2"], ["created_at", "2023-09-05 21:09:01.085819"], ["updated_at", "2023-09-05 21:09:01.085819"], ["author", nil], ["price", nil], ["published_date", nil]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "updated_at" = $1, "published_date" = $2 WHERE "books"."id" = $3  [["updated_at", "2023-09-12 19:16:32.859905"], ["published_date", "1984-03-23 20:32:15"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def delete
    @book = Book.find(params[:id])